def p1():
    countries_dict = {"Австрия": "Вена", "Бельгия": "Брюссель", "Великобритания": "Лондон", "Германия": "Берлин",
                      "Ирландия": "Дублин", "Лихтенштейн": "Вадуц", "Нидерладны": "Амстердам",
                      "Франция": "Париж", "Белоруссия": "Минск", "Болгария": "София", "Польша": "Варшава",
                      "Чехия": "Прага", "Албания": "Тирана", "Босния и Герцеговина": "Сараево",
                      "Северная Македония": "Скопье", "Сербия": "Белград"}
    print(countries_dict)
    a = str(input("Какая страна? "))
    try:
        print(countries_dict[a])
    except KeyError:
        print("Такой страны нет")
    for key in sorted(countries_dict):
        print(key, " - ", countries_dict[key])

def p2():
    alp = {
    "авеинорст": 1,
    "дклмпу": 2,
    "бгёья": 3,
    "йы": 4,
    "жзхцч": 5,
    "шэю": 8,
    "фщъ": 10
}
    w = input("Введите слово: ")
    s = 0
    for i in w:
        for x in alp:
            if i in x:
                s += alp[x.lower()]
    print("Сумма: ", s)

def p3():
    a = {"студент1" : "китайский, русский", "студент2" : "японский, англиский, бельгийский", "студент3" : "англиский, китайский", "студент4" : "англиский, китайский, баварский"}
    yaz1 = []
    st = []
    for i in a:
        c = a[i.lower()].split(", ")
        for x in c:
            yaz1.append(x)
            if x == "китайский":
                st.append(i)
    yaz = sorted(set(yaz1))
    print(yaz)
    print(st)


p1()
p2()
p3()
